STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OnOff_Client_Router_ThreadX/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "tx_api.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.onoff.h"

/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               5000U
#define CHANNEL                                     13

#define SW1_ENDPOINT                                17

/* USER CODE BEGIN PD */
#define SW1_GROUP_ADDR          0x0001
#define PB_REBOUND_DELAY        250

#ifdef TX_ENABLE_EVENT_TRACE
#define APP_MAX_THREAD			8u
#define DEBUG_TRACEX_SIZE		(64u * 1024u )
#define APP_TRACE_INFO          (TX_TRACE_USER_EVENT_START + 1)
#endif // TX_ENABLE_EVENT_TRACE
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

static void APP_ZIGBEE_ProcessNotifyM0ToM4(ULONG thread_input);
static void APP_ZIGBEE_ProcessRequestM0ToM4(ULONG thread_input);
static void APP_ZIGBEE_ProcessNwkForm(ULONG thread_input);
static void APP_ZIGBEE_ProcessPushButton(ULONG thread_input);

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_ConfigGroupAddr(void);
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

TX_THREAD OsTaskNotifyM0ToM4Id;
TX_THREAD OsTaskRequestM0ToM4Id;
TX_THREAD OsTaskNwkFormId;
TX_THREAD OsTaskPushButtonId;
TX_MUTEX MtxZigbeeId;

TX_SEMAPHORE TransferToM0Semaphore;
TX_SEMAPHORE StartupEndSemaphore;

TX_SEMAPHORE NWKFormSemaphore;
TX_SEMAPHORE NotifyM0ToM4Semaphore;
TX_SEMAPHORE RequestM0ToM4Semaphore;
TX_SEMAPHORE PushButtonSemaphore;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  bool init_after_join;

  struct ZbZclClusterT *onOff_client_1;
};
static struct zigbee_app_info zigbee_app_info;

/* USER CODE BEGIN PV */
#ifdef TX_ENABLE_EVENT_TRACE
static UCHAR	cDebugTraceX[DEBUG_TRACEX_SIZE];
#endif // TX_ENABMLE_EVENT_TRACE

/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(TX_BYTE_POOL* p_byte_pool)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;
  CHAR* pointer = TX_NULL;
  UINT ThreadXStatus = TX_THREAD_ERROR;
  
  APP_DBG("APP_ZIGBEE_Init");
  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

#ifdef TX_ENABLE_EVENT_TRACE
  // -- Enable ThreadX Trace --
  tx_trace_enable( cDebugTraceX, sizeof(cDebugTraceX), APP_MAX_THREAD );
#endif // TX_ENABLE_EVENT_TRACE
  
  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Initialize the mutex */
  tx_mutex_create(&MtxZigbeeId, "MtxZigbeeId", TX_NO_INHERIT);
  
  /* Initialize the semaphores */
  tx_semaphore_create(&StartupEndSemaphore, "StartupEndSemaphore", 0); /*< Create the semaphore and make it busy at initialization */
  tx_semaphore_create(&TransferToM0Semaphore, "TransferToM0Semaphore", 0); 
  tx_semaphore_create(&NWKFormSemaphore, "NWKFormSemaphore", 0);
  tx_semaphore_create(&NotifyM0ToM4Semaphore, "NotifyM0ToM4Semaphore", 0);
  tx_semaphore_create(&RequestM0ToM4Semaphore, "RequestM0ToM4Semaphore", 0);
  tx_semaphore_create(&PushButtonSemaphore, "PushButtonSemaphore", 0);

  /* Register task */
  /* Create the different tasks */
  tx_byte_allocate(p_byte_pool, (VOID**) &pointer, DEMO_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskNotifyM0ToM4Id,
                                   "OsTaskNotifyM0ToM4Id",
                                   APP_ZIGBEE_ProcessNotifyM0ToM4,
                                   0,
                                   pointer,
                                   DEMO_STACK_SIZE_LARGE,
                                   16,
                                   16,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
    { APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED,1); }
  
  tx_byte_allocate(p_byte_pool, (VOID**) &pointer, DEMO_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskRequestM0ToM4Id,
                                   "OsTaskRequestM0ToM4Id",
                                   APP_ZIGBEE_ProcessRequestM0ToM4,
                                   0,
                                   pointer,
                                   DEMO_STACK_SIZE_LARGE,
                                   16,
                                   16,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
    { APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED,1); }
    
